tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "oven-sh/bun"
tap "railwaycat/emacsmacport"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "apr-util"
brew "asimov", restart_service: true
brew "bash"
brew "python@3.12"
brew "glib"
brew "pycparser"
brew "cffi"
brew "circleci"
brew "cloud-sql-proxy"
brew "ruby"
brew "coreutils"
brew "cryptography"
brew "libssh2"
brew "rtmpdump"
brew "curl"
brew "direnv"
brew "dos2unix"
brew "fd"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "libass"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "freetds"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-extras"
brew "git-quick-stats"
brew "diff-so-fancy"
brew "glow"
brew "gnu-typist"
brew "gobject-introspection"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "htop"
brew "hub"
brew "icdiff"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "jq"
brew "keyring"
brew "jrnl"
brew "k6"
brew "libfido2"
brew "libpq"
brew "libxml2"
brew "marked"
brew "mas"
brew "n"
brew "nginx", restart_service: true
brew "nyancat"
brew "opencc"
brew "openssl@1.1"
brew "pillow"
brew "postgresql@14", restart_service: true
brew "pyenv"
brew "python@3.11"
brew "ripgrep"
brew "ruby@3.1"
brew "shellcheck"
brew "shfmt"
brew "stow"
brew "tig"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh"
brew "oven-sh/bun/bun"
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-native-comp", "with-native-compilation", "without-modules"]
cask "arc"
cask "gitup"
cask "google-cloud-sdk"
cask "imageoptim"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
cask "raycast"
cask "squirrel"
cask "syntax-highlight"
cask "typora"
cask "visual-studio-code"
cask "xquartz"
cask "zoom"
mas "Byword", id: 420212497
mas "DaisyDisk", id: 411643860
mas "DevCleaner", id: 1388020431
mas "Hand Mirror", id: 1502839586
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "pomodorome", id: 1484801884
mas "Sip", id: 507257563
mas "Telegram", id: 747648890
mas "Xcode", id: 497799835
vscode "esbenp.prettier-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hant"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "tuttieee.emacs-mcx"
vscode "unifiedjs.vscode-mdx"
